from flask import Flask,jsonify,make_response
from flask import request
from flask_cors import CORS, cross_origin
from flask import render_template

app = Flask(__name__)
CORS(app, support_credentials=True)

@app.route('/')
@cross_origin(supports_credentials=True)
def hello_world():
	return render_template("index.html")

@app.route('/send',methods=['Post'])
@cross_origin(supports_credentials=True)
def send_data():
	accessKey=request.form.get('accessKey')
	if (accessKey=="welcomeMenu"):
		return make_response(jsonify({"message":'''नमस्ते 🙏
यह भारत सरकार के कोरोनावायरस (COVID-19) हेल्पडेस्क जागरूकता पैदा करने और आपको और आपके परिवार को सुरक्षित रखने में मदद करने के लिए है।
<br><br>
किसी भी आपात स्थिति के लिए 👇
हेल्पलाइन: 011-23978046 | टोल-फ्री नंबर: 1075
ईमेल: ncov2019@gov.in
<br><br>
कृपया निम्न विकल्पों में से चुनें ''',"tickets":[["1","1. भारत में कोरोनावायरस पर नवीनतम अपडेट"],["2","2. कोरोनावायरस क्या है और इसके लक्षण क्या हैं?"],["3","3. कोरोनावायरस के जोखिम को कैसे कम करें?"],["4","4. एम्स-निदेशक द्वारा पेशेवर सलाह"],["5","5. कोरोनावायरस पर अधिक जानिए (जनता कर्फ्यू सहित)"],["6","6. सहायता कहाँ से प्राप्त करें?"]]}))
	if (accessKey=="mainMenu"):
		return make_response(jsonify({"message":"कृपया निम्न विकल्पों में से चुनें:","tickets":[["1","1.भारत में कोरोनावायरस पर नवीनतम अपडेट"],["2","2.कोरोनावायरस क्या है और इसके लक्षण क्या हैं?"],["3","3.कोरोनावायरस के जोखिम को कैसे कम करें?"],["4","4.एम्स-निदेशक द्वारा पेशेवर सलाह"],["5","5.कोरोनावायरस पर अधिक जानिए (जनता कर्फ्यू सहित)"],["6","6.सहायता कहाँ से प्राप्त करें?"]]}))
	if (accessKey=="1"):
		return make_response(jsonify({"message":'''COVID-19 अपडेट 23.03.2020 को 08:15 बजे पर
<br>
पुष्टि मामले: 467 (विदेशी नागरिक शामिल हैं)
सक्रिय मामले: 424
ठीक / छुट्टी दे दी मामलों: 34
मौत के मामले: 9
<br>
कृपया घर पर रहें और अपने आप को, परिवार और समुदाय को सुरक्षित रखने में मदद करने के लिए लॉक-डाउन और सामाजिक दूरी की सलाह का पालन करें
<br>
19 राज्य / संघ शासित प्रदेशों ने पूर्ण तालाबंदी आदेश जारी किए हैं
https://blog.mygov.in/Lockdown_Status_23-3-2020.pdf
6 राज्य / केंद्रशासित प्रदेशों में कुछ क्षेत्रों में तालाबंदी है
3 राज्य / संघ राज्य क्षेत्रों ने कुछ गतिविधियों को बंद करने के लिए निर्देश जारी किया है

देश में COVID-19 के लिए परीक्षण सुविधाएं ID
<br>
संचालन सरकार ने किया। प्रयोगशालाएँ: 89
सरकार। प्रयोगशालाएँ (प्रचालित की जा रही हैं): ०.१
प्राधिकृत निजी प्रयोगशालाएँ: 6
<br>
COVID-19 मामलों की रिपोर्ट करने वाले जिलों की सूची नीचे देखें districts
<br>
https://www.mohfw.gov.in/pdf/DistrictWiseList324.pdf

कोरोनावायरस की विस्तृत जानकारी के लिए, कृपया नीचे दिए गए लिंक की जाँच करें
<br>
https://www.mygov.in/covid-19
https://www.mohfw.gov.in''',"tickets":[["2","2. कोरोनावायरस क्या है और इसके लक्षण क्या हैं?"],["mainMenu","मुख्य मेनू पर वापस जाएं"]]}))

	if (accessKey=="2"):
		return make_response(jsonify({"message":'''कोरोनावीरस वायरस का एक बड़ा परिवार है, कुछ लोगों में बीमारी का कारण बनता है। मनुष्यों में इसके लक्षण हैं
<br>
 🤒 बुखार
 <br>
 Problem सांस लेने में समस्या
 <br>
 Ing खांसी होना
 <br>
 Of छाती की जकड़न
 <br>
 Ose रनिंग नोज़
<br>
 😨 सिरदर्द
 <br>
 🌡 अस्वस्थ महसूस करना
 <br>
 Onia निमोनिया
 <br>
 Ail गुर्दे की विफलता
<br>
अकेले लक्षणों के आधार पर बीमारी की पहचान करना मुश्किल हो सकता है। जाँच करें कि आपको कब tested का परीक्षण करवाना चाहिए
<br>
https://www.mohfw.gov.in/FINAL_14_03_2020_ENg.pdf
<br>
आप निर्देशक, एम्स-दिल्ली by द्वारा लक्षणों पर वीडियो भी देख सकते हैं
<br>
https://youtu.be/E8-UoeWewFI''',"tickets":[["3","3. कोरोनावायरस के जोखिम को कैसे कम करें?"],["mainMenu","मुख्य मेनू पर वापस जाएं"]]}))

	if (accessKey=="3"):
		return make_response(jsonify({"message":'''
कोरोनावायरस एक संक्रमित व्यक्ति से from के माध्यम से फैलता है
<br>
नाक या मुंह से छोटी-छोटी बूंदें जो किसी व्यक्ति के खांसने या छींकने पर फैलती हैं
<br>
इन बूंदों को  संपर्क  एक वस्तु या सतह को छूना और फिर अपने हाथ धोने से पहले अपने मुंह, नाक या आंखों को छूना
<br>
व्यक्तिगत संपर्क बंद करें, जैसे कि हाथ को छूना या हिलाना
<br>
कृपया अधिक जानकारी के लिए वीडियो देखें 
<br>
https://youtu.be/0MgNgcwcKzE''',"tickets":[["4","4. एम्स-निदेशक द्वारा पेशेवर सलाह"],["mainMenu","मुख्य मेनू पर वापस जाएं"]]}))

	if (accessKey=="4"):
		return make_response(jsonify({"message":'''कोरोनोवायरस संक्रमण को निम्न साधनों के माध्यम से रोका जा सकता है 
<br>
✔ साबुन और पानी या शराब आधारित हाथ रगड़ के साथ साफ हाथ
https://youtu.be/EJbjyo2xa2o
<br>
✔ टिश्यू या फ्लेक्सिबल एल्बो से खाँसने और छींकने पर नाक और मुंह ढकें
https://youtu.be/f2b_hgncFi4
<br>
✔ खांसी या छींकने वाले किसी भी व्यक्ति के साथ निकट संपर्क से बचें और 1 मीटर की दूरी बनाए रखें
https://youtu.be/mYyNQZ6IdRk
<br>
✔ कम से कम 14 दिनों के लिए प्रभावित देशों या स्थानों से यात्रा करने वाले व्यक्तियों का अलगाव
https://www.mohfw.gov.in/AdditionalTravelAdvisory1homeisolation.pdf
<br>
अगर सलाह दी जाए तो संगरोध करें
https://www.mohfw.gov.in/Guidelinesforhomequarantine.pdf''',"tickets":[["5","5.कोरोनावायरस पर अधिक जानिए (जनता कर्फ्यू सहित)"],["mainMenu","मुख्य मेनू पर वापस जाएं"]]}))

	if (accessKey=="5"):
		return make_response(jsonify({"message":'''कृपया कोरोनोवायरस पर अपने संदेह को जानने और साफ़ करने के लिए निदेशक, एम्स - दिल्ली द्वारा वीडियो देखें
<br>
https://youtu.be/JXobDg2Fpn4
<br>
https://youtu.be/E8-UoeWewFI
<br>
https://youtu.be/5wCZdcAsvE8
<br>
https://youtu.be/mYyNQZ6IdRk
<br>
https://youtu.be/08ryxbcT3-o''',"tickets":[["6","6.सहायता कहाँ से प्राप्त करें?"],["mainMenu","मुख्य मेनू पर वापस जाएं"]]}))

	if (accessKey=="6"):
		return make_response(jsonify({"message":'''भारत में चिकित्सीय मदद के लिए कृपया 24/7 कंट्रोल रूम में पहुँचें।
<br>
📞 फोन: + 91-11-23978046
<br>
📞 टोल-फ्री नंबर: 1075
<br>
✉ ईमेल: ncov2019@gov.in
💬 शेयर व्हाट्सएप्प लिंक: https://wa.me/919013151515?text=hi
<br>
भारत के बाहर के व्यक्ति से पूछताछ के लिए। कृपया विदेश मंत्रालय (MEA), भारत सरकार से संपर्क करें
<br>
📞 1800118797
✉ covid19@mea.gov.in
<br>
वीज़ा से संबंधित प्रश्नों के लिए
<br>
📞 01124300666
✉ support.covid19-boi@gov.in''',"tickets":[["mainMenu","मुख्य मेनू पर वापस जाएं"]]}))

